public/index.org
#+TITLE: Introduction to Statistics (4SWS), HU-Berlin 2021
#+AUTHOR: Dale Barr
#+options: html-link-use-abs-url:nil html-postamble:auto
#+options: html-preamble:t html-scripts:t html-style:t
#+options: html5-fancy:nil tex:t ^:nil num:nil toc:nil
#+html_doctype: xhtml-strict
#+html_container: div
#+html_head: <link rel="stylesheet" type="text/css" href="css/my_css.css" />
#+description:
#+keywords:
#+html_link_home:
#+html_link_up:
#+html_mathjax:
#+html_head:
#+html_head_extra:
#+subtitle:
#+infojs_opt:
#+creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.3)
#+latex_header:

| Day        |        Time | Topic                                                         |
|------------+-------------+---------------------------------------------------------------|
| Tue 06-Apr | 10:00-13:00 | Getting started with R/RStudio ([[file:01_data_wrangling/morning_intro_to_R/intro_to_coding_in_R.html][walkthrough]])                  |
|            | 14:00-17:00 | Introduction to data wrangling and the tidyverse ([[file:01_data_wrangling/afternoon_intro_to_data_wrangling/index.org][walkthough]]) |
|------------+-------------+---------------------------------------------------------------|
| Wed 07-Apr | 10:00-13:00 | Further wrangling & visualization I                           |
|            | 14:00-17:00 | Further wrangling & visualization II                          |
|------------+-------------+---------------------------------------------------------------|
| Thu 08-Apr | 10:00-13:00 | Univariate distributions                                      |
|            | 14:00-17:00 | Bivariate distributions / correlation                         |
|------------+-------------+---------------------------------------------------------------|
| Fri 09-Apr | 10:00-13:00 | t-tests: NHST, power, effect size                             |
|            | 14:00-17:00 | One-way Analysis of Variance (ANOVA)                          |
|------------+-------------+---------------------------------------------------------------|
| Sat 10-Apr | 10:00-13:00 | Regression                                                    |
|            | 14:00-17:00 | Multiple regression                                           |
|------------+-------------+---------------------------------------------------------------|
| Sat 17-Apr | 10:00-13:00 | Continuous-by-categorical interactions                        |
|            | 14:00-17:00 | Factorial ANOVA                                               |
|------------+-------------+---------------------------------------------------------------|
| Sat 24-Apr | 10:00-13:00 | Linear Mixed-Effects Models (LMMs)                            |
|            | 14:00-17:00 | LMMs with crossed random effects of subjects and stimuli      |
|------------+-------------+---------------------------------------------------------------|
| Sat 01-May | 10:00-13:00 | Catch-up / review / Q&A                                       |
|            | 14:00-17:00 | Catch-up / review / Q&A                                       |
|------------+-------------+---------------------------------------------------------------|

* Course description

This course provides an introduction to experiment design and statistics. Various designs and associated inferential statistical analysis procedures are discussed using the framework of the General Linear Model. These include, for example, the t-test, correlation and regression, and basics of analysis of variance (ANOVA). This course includes practical application of theoretical knowledge. Using a computer-based statistics program, participants will become familiar with the analysis of statistical data through practice examples.

At the end of the course, participants should be able to: 

- write an analysis script performing basic data transformations,
  visualizations, and analysis

- identify appropriate analysis procedures depending on design and
  data type

- perform data simulations for simple designs

- describe and explain the assumptions behind the methods

- interpret statistical output and relate it to statistical hypotheses

- apply these techniques to a variety of example data sets

** How each day will be structured

  | 10:00-11:25 | (quiz) + Q&A + lecture + live coding   |
  | 11:25-11:35 | BREAK                                  |
  | 11:35-13:00 | self-paced exercises in breakout rooms |
  | 13:00-14:00 | BREAK                                  |
  | 14:00-15:25 | (quiz) + Q&A + lecture + live coding   |
  | 15:25-15:35 | BREAK                                  |
  | 15:35-17:00 | self-paced exercises in breakout rooms |

* Getting access to R / RStudio software

For this course, you will need access to R and RStudio. In the best case, you should install it on your own laptop or desktop computer. To do so, please [[file:00_installation/installation.html][follow these instructions]]. 

If you already have R and RStudio installed, please upgrade to the latest versions (R 4.0.3 and RStudio Desktop 1.4.1103). TIP: Upgrade R first, then RStudio Desktop, then your R packages. [[https://bootstrappers.umassmed.edu/bootstrappers-courses/courses/rCourse/Additional_Resources/Updating_R.html][Here are some instructions that work for this]].

If installing R/RStudio is not possible, because (1) you are using a laptop with outdated software or limited capabilities (such as Google Chromebook) (2) you experience insurmountable installation problems (such as lack of admin privileges), here are two fallback options that allow you to run R/RStudio through a web browser.

- Fallback 1: [[https://rstudio.cloud/plans/free][RStudio Cloud]]. This is free, and has most of the capabilities you need. However, you have a limited number of free hours per month. If you run out of hours, then you have to pay for more.

- Fallback 2: [[https://towardsdatascience.com/how-to-use-r-in-google-colab-b6e02d736497][Google Colab]]. I haven't used this myself, but apparently it is possible to run R, and you will not face any usage limits. However, the interface is different and it will probably be difficult to get help if you get stuck.


* Extra materials

If you need an extra challenge, consider the following materials.

** Data wrangling practice
- [[file:extra/scoring_AQ/index.org][Scoring the AQ-10]]
- [[file:extra/disgust/index.org][More data tidying and joins: The =disgust= dataset]]
- Scoring the EQ-Short and SQ-Short [hard!]: ([[file:extra/EQ_SQ/EQ_SQ_wrangle.Rmd][Rmd_source]]) ([[file:extra/EQ_SQ/solution.html][solution_html]]) ([[file:extra/EQ_SQ/solution.Rmd][solution_Rmd]]) ([[file:extra/EQ_SQ_files.zip][data_files]])

** Data visualization practice
- [[file:extra/factorial_plots/factorial_plots.html][Factorial plots]]

