docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-06 Tue 07:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Introduction to Statistics (4SWS), HU-Berlin 2021</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Dale Barr" />
<link rel="stylesheet" type="text/css" href="css/my_css.css" />
</head>
<body>
<div id="content">
<h1 class="title">Introduction to Statistics (4SWS), HU-Berlin 2021</h1>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Day</th>
<th scope="col" class="org-right">Time</th>
<th scope="col" class="org-left">Topic</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Tue 06-Apr</td>
<td class="org-right">10:00-13:00</td>
<td class="org-left">Getting started with R/RStudio (<a href="01_data_wrangling/morning_intro_to_R/intro_to_coding_in_R.html">walkthrough</a>)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">14:00-17:00</td>
<td class="org-left">Introduction to data wrangling and the tidyverse (<a href="01_data_wrangling/afternoon_intro_to_data_wrangling/index.html">walkthough</a>)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Wed 07-Apr</td>
<td class="org-right">10:00-13:00</td>
<td class="org-left">Further wrangling &amp; visualization I</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">14:00-17:00</td>
<td class="org-left">Further wrangling &amp; visualization II</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Thu 08-Apr</td>
<td class="org-right">10:00-13:00</td>
<td class="org-left">Univariate distributions</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">14:00-17:00</td>
<td class="org-left">Bivariate distributions / correlation</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Fri 09-Apr</td>
<td class="org-right">10:00-13:00</td>
<td class="org-left">t-tests: NHST, power, effect size</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">14:00-17:00</td>
<td class="org-left">One-way Analysis of Variance (ANOVA)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Sat 10-Apr</td>
<td class="org-right">10:00-13:00</td>
<td class="org-left">Regression</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">14:00-17:00</td>
<td class="org-left">Multiple regression</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Sat 17-Apr</td>
<td class="org-right">10:00-13:00</td>
<td class="org-left">Continuous-by-categorical interactions</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">14:00-17:00</td>
<td class="org-left">Factorial ANOVA</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Sat 24-Apr</td>
<td class="org-right">10:00-13:00</td>
<td class="org-left">Linear Mixed-Effects Models (LMMs)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">14:00-17:00</td>
<td class="org-left">LMMs with crossed random effects of subjects and stimuli</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Sat 01-May</td>
<td class="org-right">10:00-13:00</td>
<td class="org-left">Catch-up / review / Q&amp;A</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">14:00-17:00</td>
<td class="org-left">Catch-up / review / Q&amp;A</td>
</tr>
</tbody>
</table>

<div id="outline-container-orgdb4c6f9" class="outline-2">
<h2 id="orgdb4c6f9">Course description</h2>
<div class="outline-text-2" id="text-orgdb4c6f9">
<p>
This course provides an introduction to experiment design and statistics. Various designs and associated inferential statistical analysis procedures are discussed using the framework of the General Linear Model. These include, for example, the t-test, correlation and regression, and basics of analysis of variance (ANOVA). This course includes practical application of theoretical knowledge. Using a computer-based statistics program, participants will become familiar with the analysis of statistical data through practice examples.
</p>

<p>
At the end of the course, participants should be able to: 
</p>

<ul class="org-ul">
<li>write an analysis script performing basic data transformations,
visualizations, and analysis</li>

<li>identify appropriate analysis procedures depending on design and
data type</li>

<li>perform data simulations for simple designs</li>

<li>describe and explain the assumptions behind the methods</li>

<li>interpret statistical output and relate it to statistical hypotheses</li>

<li>apply these techniques to a variety of example data sets</li>
</ul>
</div>

<div id="outline-container-org21a1f39" class="outline-3">
<h3 id="org21a1f39">How each day will be structured</h3>
<div class="outline-text-3" id="text-org21a1f39">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">10:00-11:25</td>
<td class="org-left">(quiz) + Q&amp;A + lecture + live coding</td>
</tr>

<tr>
<td class="org-right">11:25-11:35</td>
<td class="org-left">BREAK</td>
</tr>

<tr>
<td class="org-right">11:35-13:00</td>
<td class="org-left">self-paced exercises in breakout rooms</td>
</tr>

<tr>
<td class="org-right">13:00-14:00</td>
<td class="org-left">BREAK</td>
</tr>

<tr>
<td class="org-right">14:00-15:25</td>
<td class="org-left">(quiz) + Q&amp;A + lecture + live coding</td>
</tr>

<tr>
<td class="org-right">15:25-15:35</td>
<td class="org-left">BREAK</td>
</tr>

<tr>
<td class="org-right">15:35-17:00</td>
<td class="org-left">self-paced exercises in breakout rooms</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org2c44bd1" class="outline-2">
<h2 id="org2c44bd1">Getting access to R / RStudio software</h2>
<div class="outline-text-2" id="text-org2c44bd1">
<p>
For this course, you will need access to R and RStudio. In the best case, you should install it on your own laptop or desktop computer. To do so, please <a href="00_installation/installation.html">follow these instructions</a>. 
</p>

<p>
If you already have R and RStudio installed, please upgrade to the latest versions (R 4.0.3 and RStudio Desktop 1.4.1103). TIP: Upgrade R first, then RStudio Desktop, then your R packages. <a href="https://bootstrappers.umassmed.edu/bootstrappers-courses/courses/rCourse/Additional_Resources/Updating_R.html">Here are some instructions that work for this</a>.
</p>

<p>
If installing R/RStudio is not possible, because (1) you are using a laptop with outdated software or limited capabilities (such as Google Chromebook) (2) you experience insurmountable installation problems (such as lack of admin privileges), here are two fallback options that allow you to run R/RStudio through a web browser.
</p>

<ul class="org-ul">
<li>Fallback 1: <a href="https://rstudio.cloud/plans/free">RStudio Cloud</a>. This is free, and has most of the capabilities you need. However, you have a limited number of free hours per month. If you run out of hours, then you have to pay for more.</li>

<li>Fallback 2: <a href="https://towardsdatascience.com/how-to-use-r-in-google-colab-b6e02d736497">Google Colab</a>. I haven&rsquo;t used this myself, but apparently it is possible to run R, and you will not face any usage limits. However, the interface is different and it will probably be difficult to get help if you get stuck.</li>
</ul>
</div>
</div>


<div id="outline-container-orgb306671" class="outline-2">
<h2 id="orgb306671">Extra materials</h2>
<div class="outline-text-2" id="text-orgb306671">
<p>
If you need an extra challenge, consider the following materials.
</p>
</div>

<div id="outline-container-org0a585a3" class="outline-3">
<h3 id="org0a585a3">Data wrangling practice</h3>
<div class="outline-text-3" id="text-org0a585a3">
<ul class="org-ul">
<li><a href="extra/scoring_AQ/index.html">Scoring the AQ-10</a></li>
<li><a href="extra/disgust/index.html">More data tidying and joins: The <code>disgust</code> dataset</a></li>
<li>Scoring the EQ-Short and SQ-Short [hard!]: (<a href="extra/EQ_SQ/EQ_SQ_wrangle.Rmd">Rmd_source</a>) (<a href="extra/EQ_SQ/solution.html">solution_html</a>) (<a href="extra/EQ_SQ/solution.Rmd">solution_Rmd</a>) (<a href="extra/EQ_SQ_files.zip">data_files</a>)</li>
</ul>
</div>
</div>

<div id="outline-container-org02ab881" class="outline-3">
<h3 id="org02ab881">Data visualization practice</h3>
<div class="outline-text-3" id="text-org02ab881">
<ul class="org-ul">
<li><a href="extra/factorial_plots/factorial_plots.html">Factorial plots</a></li>
</ul>
</div>
</div>
