public/index.org
** Model specification                                             :noexport:
- [[https://talklab.psy.gla.ac.uk/tvw/catpred][Coding categorical predictors in factorial designs]]

- Extra practice with linear regression: ([[file:extra/extra_lm_practice.Rmd][source Rmd file]]) ([[file:extra/extra_lm_solution.html][solution]])

** Data simulation
- [[file:extra/binary/binary.html][Simulating binary data]]

** Scripts from Live Coding Sessions                               :noexport:
- Scottish babynames script from Monday morning: [[file:01_monday/morning_intro_to_R/names.R][names.R]]
- Data wrangling and data tidying: [[file:01_monday/afternoon_intro_to_data_wrangling/01_monday_afternoon_script.R][01_monday_afternoon_script.R]]
- [[file:extra/misc/misc.html][Miscellaneous extra things (Thursday morning)]]


* Additional Resources

These materials are not required; some are reference materials, others allow you to dive further into various topics.

** RMarkdown

- Blog post from The R Graph Gallery: [[https://holtzy.github.io/Pimp-my-rmd/][Pimp my Rmd: A few tips for RMarkdown]]

** Course materials from University of Glasgow Psychology

- [[https://psyteachr.github.io/ug1-practical/][Undergraduate Statistics Year 1 Materials]] (Data Wrangling & Visualization; Basic Probability)
- [[https://psyteachr.github.io/ug2-practical/][Undergraduate Statistics Year 2 Materials]] (Basic Statistics, Intro to the General Linear Model)
- [[https://psyteachr.github.io/ug3-stats/][Undergraduate Statistics Year 3 Materials]] (Statistical Models)
- [[https://psyteachr.github.io/msc-data-skills/][MSc course: Data Skills for Reproducible Science]] (Data Wrangling & Visualization)

- [[https://psyteachr.github.io/hack-your-data/][Hack Your Data Beautiful workshop]] (a summer workshop for postgrads by postgrads)

** Data visualization

- Kelleher, C., & Wagener, T. (2011). [[https://www.sciencedirect.com/science/article/pii/S1364815210003270][Ten guidelines for effective data visualization in scientific publications]]. /Environmental Modeling & Software/.
- Rougier, N. P., Droettboom, M., & Bourne, P. E. (2014). [[http://journals.plos.org/ploscompbiol/article?id=10.1371/journal.pcbi.1003833][Ten Simple Rules for Better Figures]], /PLOS Computational Biology/.
- Tufte, E. (2001). /The visual display of quantitative information./ 
- McCandliss, D. (2012) /Information is beautiful./
- [[http://docs.ggplot2.org/current][ggplot2 documentation]]
- [[http://www.cookbook-r.com/Graphs][R graphics cookbook]]

** Regression

- Lindeløv, J. K. (blog post). [[https://lindeloev.github.io/tests-as-linear/][Common statistical tests are linear models.]]
- Schielzeth, H. (2010). [[https://besjournals.onlinelibrary.wiley.com/doi/abs/10.1111/j.2041-210X.2010.00012.x][Simple means to improve the interpretability of regression coefficients]]. /Methods in Ecology and Evolution/, /1/, 103--113.
- Blog post by Dale: [[http://talklab.psy.gla.ac.uk/tvw/catpred/][Coding categorical variables when analyzing factorial experiments with regression]]
- Jan Vanhove, [[https://janhove.github.io/analysis/2019/09/11/collinearity][Collinearity isn't a disease that needs curing]]
- Jan Vanhove, [[https://janhove.github.io/analysis/2018/04/25/graphical-model-checking][Checking model assumptions without getting paranoid]]

** ANOVA

- Blog post by Henrik Singmann: [[http://singmann.org/anova-in-r-afex-may-be-the-solution-you-are-looking-for/][ANOVA in R: afex may be the solution you are looking for]]

** Mixed-effects modeling

- Baayen, R. H., Davidson, D. J., Bates, D. M. (2008). [[https://www.sciencedirect.com/science/article/pii/S0749596X07001398][Mixed-effects modeling with crossed random effects for subjects and items]]. /59/, 390--412.

- Barr, D. J. (2018). Generalizing over encounters: Statistical and theoretical considerations. S-A. Rueschemeyer and G. Gaskell (Eds.), /Oxford Handbook of Psycholinguistics/. ([[https://osf.io/u8yxs/download][preprint]])

- Barr, D. J. (2013). [[https://www.frontiersin.org/articles/10.3389/fpsyg.2013.00328/full][Random effects structure for testing interactions in linear mixed-effects models]]. /Frontiers in Psychology/, 328.

- Barr, D. J., Levy, R., Scheepers, C., & Tily, H. (2013). [[http://dx.doi.org/10.1016/j.jml.2012.11.001][Random effects structure for confirmatory hypothesis testing: Keep it maximal]]. /Journal of Memory and Language/, /68/, 255--278.

- Bates, D. M., Mächler, M., Bolker, B. M., Walker S. C. (2014). Fitting linear mixed-effects models using lme4. http://arxiv.org/pdf/1406.5823.pdf (technical)

- Bolker, B. M., et al. (2009). [[https://www.sciencedirect.com/science/article/pii/S0169534709000196][Generalized linear mixed models: A practical guide for ecology and evolution]]. /Trends in Ecology & Evolution/, /24/, 127--135.

- Brauer, M. & Curtin, J. J. (2018). [[https://psycnet.apa.org/doiLanding?doi=10.1037%2Fmet0000159][Linear mixed-effects models and the analysis of nonindependent data: A unified framework to analyze categorical and continuous independent variables that vary within-subjects and/or within-items.]]

- DeBruine, L. & Barr, D. J. (2021). [[https://psyarxiv.com/xp5cy/][Understanding Mixed-Effects Models Through Data Simulation (preprint)]] [[https://journals.sagepub.com/doi/full/10.1177/2515245920965119][(published version)]]

- Halekoh, U., and Hoejsgaard, S. (2014). [[https://www.jstatsoft.org/article/view/v059i09][A Kenward-Roger Approximation and Parametric Bootstrap Methods for Tests in Linear Mixed Models The R Package pbkrtest]].

- Judd, C. M., Westfall, J., Kenny, D. A. (2012). [[http://jakewestfall.org/publications/JWK.pdf][Treating stimuli as a random factor in social psychology: A new and comprehensive solution to a pervasive but largely ignored problem]]. /Journal of Personality and Social Psychology/, /103/, 54--69.

- Luke, S. G. (2016) [[https://link.springer.com/article/10.3758/s13428-016-0809-y][Evaluating significance in linear mixed-effects models]].

- Mahr, T., [[https://tjmahr.github.io/plotting-partial-pooling-in-mixed-effects-models/][Plotting partial pooling in mixed-effects models]]

- Matuschek, H., Kliegl, R., Vasishth, S., Baayen, H., Bates, D. (2017). [[https://www.sciencedirect.com/science/article/pii/S0749596X17300013][Balancing Type I error and power in linear mixed models]]

- Meteyard, L. & Davies, R. A. I. (2020). [[https://www.sciencedirect.com/science/article/pii/S0749596X20300061][Best practice guidance for linear mixed-effects models in psychological science]].

- Westfall, J., Kenny, D. A., and Judd, C. M. (2014), [[http://psych.colorado.edu/~westfaja/crossed_power_JEPG.pdf][Statistical power and optimal design in experiments where participants respond to samples of stimuli]]. /Journal of Experimental Psychology: General/, /143/.

- =r-lang= and =r-sig-mixed-models= mailing lists

- =r-sig-mixed-models= FAQ http://glmm.wikidot.com/faq

- blog post by Doug Bates on [[https://rpubs.com/dmbates/377897][running MixedModels from the Julia programming language in R]] (faster than =lme4::lmer()=)

