docs/index.html

<div id="outline-container-org925ea81" class="outline-3">
<h3 id="org925ea81">Data simulation</h3>
<div class="outline-text-3" id="text-org925ea81">
<ul class="org-ul">
<li><a href="extra/binary/binary.html">Simulating binary data</a></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org19cdc26" class="outline-2">
<h2 id="org19cdc26">Additional Resources</h2>
<div class="outline-text-2" id="text-org19cdc26">
<p>
These materials are not required; some are reference materials, others allow you to dive further into various topics.
</p>
</div>

<div id="outline-container-orgd1a9d00" class="outline-3">
<h3 id="orgd1a9d00">RMarkdown</h3>
<div class="outline-text-3" id="text-orgd1a9d00">
<ul class="org-ul">
<li>Blog post from The R Graph Gallery: <a href="https://holtzy.github.io/Pimp-my-rmd/">Pimp my Rmd: A few tips for RMarkdown</a></li>
</ul>
</div>
</div>

<div id="outline-container-org3febaf4" class="outline-3">
<h3 id="org3febaf4">Course materials from University of Glasgow Psychology</h3>
<div class="outline-text-3" id="text-org3febaf4">
<ul class="org-ul">
<li><a href="https://psyteachr.github.io/ug1-practical/">Undergraduate Statistics Year 1 Materials</a> (Data Wrangling &amp; Visualization; Basic Probability)</li>
<li><a href="https://psyteachr.github.io/ug2-practical/">Undergraduate Statistics Year 2 Materials</a> (Basic Statistics, Intro to the General Linear Model)</li>
<li><a href="https://psyteachr.github.io/ug3-stats/">Undergraduate Statistics Year 3 Materials</a> (Statistical Models)</li>
<li><a href="https://psyteachr.github.io/msc-data-skills/">MSc course: Data Skills for Reproducible Science</a> (Data Wrangling &amp; Visualization)</li>

<li><a href="https://psyteachr.github.io/hack-your-data/">Hack Your Data Beautiful workshop</a> (a summer workshop for postgrads by postgrads)</li>
</ul>
</div>
</div>

<div id="outline-container-orgd42f217" class="outline-3">
<h3 id="orgd42f217">Data visualization</h3>
<div class="outline-text-3" id="text-orgd42f217">
<ul class="org-ul">
<li>Kelleher, C., &amp; Wagener, T. (2011). <a href="https://www.sciencedirect.com/science/article/pii/S1364815210003270">Ten guidelines for effective data visualization in scientific publications</a>. <i>Environmental Modeling &amp; Software</i>.</li>
<li>Rougier, N. P., Droettboom, M., &amp; Bourne, P. E. (2014). <a href="http://journals.plos.org/ploscompbiol/article?id=10.1371/journal.pcbi.1003833">Ten Simple Rules for Better Figures</a>, <i>PLOS Computational Biology</i>.</li>
<li>Tufte, E. (2001). <i>The visual display of quantitative information.</i></li>
<li>McCandliss, D. (2012) <i>Information is beautiful.</i></li>
<li><a href="http://docs.ggplot2.org/current">ggplot2 documentation</a></li>
<li><a href="http://www.cookbook-r.com/Graphs">R graphics cookbook</a></li>
</ul>
</div>
</div>

<div id="outline-container-org55e1223" class="outline-3">
<h3 id="org55e1223">Regression</h3>
<div class="outline-text-3" id="text-org55e1223">
<ul class="org-ul">
<li>Lindeløv, J. K. (blog post). <a href="https://lindeloev.github.io/tests-as-linear/">Common statistical tests are linear models.</a></li>
<li>Schielzeth, H. (2010). <a href="https://besjournals.onlinelibrary.wiley.com/doi/abs/10.1111/j.2041-210X.2010.00012.x">Simple means to improve the interpretability of regression coefficients</a>. <i>Methods in Ecology and Evolution</i>, <i>1</i>, 103&#x2013;113.</li>
<li>Blog post by Dale: <a href="http://talklab.psy.gla.ac.uk/tvw/catpred/">Coding categorical variables when analyzing factorial experiments with regression</a></li>
<li>Jan Vanhove, <a href="https://janhove.github.io/analysis/2019/09/11/collinearity">Collinearity isn&rsquo;t a disease that needs curing</a></li>
<li>Jan Vanhove, <a href="https://janhove.github.io/analysis/2018/04/25/graphical-model-checking">Checking model assumptions without getting paranoid</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga01dda9" class="outline-3">
<h3 id="orga01dda9">ANOVA</h3>
<div class="outline-text-3" id="text-orga01dda9">
<ul class="org-ul">
<li>Blog post by Henrik Singmann: <a href="http://singmann.org/anova-in-r-afex-may-be-the-solution-you-are-looking-for/">ANOVA in R: afex may be the solution you are looking for</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgbdf8f5e" class="outline-3">
<h3 id="orgbdf8f5e">Mixed-effects modeling</h3>
<div class="outline-text-3" id="text-orgbdf8f5e">
<ul class="org-ul">
<li>Baayen, R. H., Davidson, D. J., Bates, D. M. (2008). <a href="https://www.sciencedirect.com/science/article/pii/S0749596X07001398">Mixed-effects modeling with crossed random effects for subjects and items</a>. <i>59</i>, 390&#x2013;412.</li>

<li>Barr, D. J. (2018). Generalizing over encounters: Statistical and theoretical considerations. S-A. Rueschemeyer and G. Gaskell (Eds.), <i>Oxford Handbook of Psycholinguistics</i>. (<a href="https://osf.io/u8yxs/download">preprint</a>)</li>

<li>Barr, D. J. (2013). <a href="https://www.frontiersin.org/articles/10.3389/fpsyg.2013.00328/full">Random effects structure for testing interactions in linear mixed-effects models</a>. <i>Frontiers in Psychology</i>, 328.</li>

<li>Barr, D. J., Levy, R., Scheepers, C., &amp; Tily, H. (2013). <a href="http://dx.doi.org/10.1016/j.jml.2012.11.001">Random effects structure for confirmatory hypothesis testing: Keep it maximal</a>. <i>Journal of Memory and Language</i>, <i>68</i>, 255&#x2013;278.</li>

<li>Bates, D. M., Mächler, M., Bolker, B. M., Walker S. C. (2014). Fitting linear mixed-effects models using lme4. <a href="http://arxiv.org/pdf/1406.5823.pdf">http://arxiv.org/pdf/1406.5823.pdf</a> (technical)</li>

<li>Bolker, B. M., et al. (2009). <a href="https://www.sciencedirect.com/science/article/pii/S0169534709000196">Generalized linear mixed models: A practical guide for ecology and evolution</a>. <i>Trends in Ecology &amp; Evolution</i>, <i>24</i>, 127&#x2013;135.</li>

<li>Brauer, M. &amp; Curtin, J. J. (2018). <a href="https://psycnet.apa.org/doiLanding?doi=10.1037%2Fmet0000159">Linear mixed-effects models and the analysis of nonindependent data: A unified framework to analyze categorical and continuous independent variables that vary within-subjects and/or within-items.</a></li>

<li>DeBruine, L. &amp; Barr, D. J. (2021). <a href="https://psyarxiv.com/xp5cy/">Understanding Mixed-Effects Models Through Data Simulation (preprint)</a> <a href="https://journals.sagepub.com/doi/full/10.1177/2515245920965119">(published version)</a></li>

<li>Halekoh, U., and Hoejsgaard, S. (2014). <a href="https://www.jstatsoft.org/article/view/v059i09">A Kenward-Roger Approximation and Parametric Bootstrap Methods for Tests in Linear Mixed Models The R Package pbkrtest</a>.</li>

<li>Judd, C. M., Westfall, J., Kenny, D. A. (2012). <a href="http://jakewestfall.org/publications/JWK.pdf">Treating stimuli as a random factor in social psychology: A new and comprehensive solution to a pervasive but largely ignored problem</a>. <i>Journal of Personality and Social Psychology</i>, <i>103</i>, 54&#x2013;69.</li>

<li>Luke, S. G. (2016) <a href="https://link.springer.com/article/10.3758/s13428-016-0809-y">Evaluating significance in linear mixed-effects models</a>.</li>

<li>Mahr, T., <a href="https://tjmahr.github.io/plotting-partial-pooling-in-mixed-effects-models/">Plotting partial pooling in mixed-effects models</a></li>

<li>Matuschek, H., Kliegl, R., Vasishth, S., Baayen, H., Bates, D. (2017). <a href="https://www.sciencedirect.com/science/article/pii/S0749596X17300013">Balancing Type I error and power in linear mixed models</a></li>

<li>Meteyard, L. &amp; Davies, R. A. I. (2020). <a href="https://www.sciencedirect.com/science/article/pii/S0749596X20300061">Best practice guidance for linear mixed-effects models in psychological science</a>.</li>

<li>Westfall, J., Kenny, D. A., and Judd, C. M. (2014), <a href="http://psych.colorado.edu/~westfaja/crossed_power_JEPG.pdf">Statistical power and optimal design in experiments where participants respond to samples of stimuli</a>. <i>Journal of Experimental Psychology: General</i>, <i>143</i>.</li>

<li><code>r-lang</code> and <code>r-sig-mixed-models</code> mailing lists</li>

<li><code>r-sig-mixed-models</code> FAQ <a href="http://glmm.wikidot.com/faq">http://glmm.wikidot.com/faq</a></li>

<li>blog post by Doug Bates on <a href="https://rpubs.com/dmbates/377897">running MixedModels from the Julia programming language in R</a> (faster than <code>lme4::lmer()</code>)</li>
</ul>
</div>
</div>
