public/index.org
** Generalized linear models

- Quené, H. & van den Bergh, H. (2008). [[https://www.sciencedirect.com/science/article/pii/S0749596X08000193][Examples of mixed-effects modeling with crossed random effects and with binomial data]].
- Liddell, T. M. & Krushke, J. K. (2018). [[https://www.sciencedirect.com/science/article/pii/S0022103117307746][Analyzing ordinal data with metric models: What could possibly go wrong?]]
- Vuorre, M., & Burkner, P. [[https://psyarxiv.com/x8swp/download?format=pdf][Ordinal regression models in psychological research: A tutorial]].  =psyarxiv.com=.

** Generalized Additive Mixed Models (Advanced)

- Thul, R., Conklin, K., Barr, D. J. (2021). [[https://psyarxiv.com/ywkeq/][Using GAMMs to model trial-by-trial fluctuations in experimental data: More risks but hardly any benefit.]]

- Sóskuthy, M. (2021). [[https://www.sciencedirect.com/science/article/pii/S009544702030108X][Evaluating generalised additive mixed modelling strategies for dynamic speech analysis]]

- Winter, B., Wieling, 

- Wood, S. (2017). [[https://www.taylorfrancis.com/books/mono/10.1201/9781315370279/generalized-additive-models-simon-wood][Generalized Additive Mixed Models.]]
