docs/index.html

<div id="outline-container-org65efd23" class="outline-3">
<h3 id="org65efd23">Generalized linear models</h3>
<div class="outline-text-3" id="text-org65efd23">
<ul class="org-ul">
<li>Quené, H. &amp; van den Bergh, H. (2008). <a href="https://www.sciencedirect.com/science/article/pii/S0749596X08000193">Examples of mixed-effects modeling with crossed random effects and with binomial data</a>.</li>
<li>Liddell, T. M. &amp; Krushke, J. K. (2018). <a href="https://www.sciencedirect.com/science/article/pii/S0022103117307746">Analyzing ordinal data with metric models: What could possibly go wrong?</a></li>
<li>Vuorre, M., &amp; Burkner, P. <a href="https://psyarxiv.com/x8swp/download?format=pdf">Ordinal regression models in psychological research: A tutorial</a>.  <code>psyarxiv.com</code>.</li>
</ul>
</div>
</div>

<div id="outline-container-org541f19a" class="outline-3">
<h3 id="org541f19a">Generalized Additive Mixed Models (Advanced)</h3>
<div class="outline-text-3" id="text-org541f19a">
<ul class="org-ul">
<li>Thul, R., Conklin, K., Barr, D. J. (2021). <a href="https://psyarxiv.com/ywkeq/">Using GAMMs to model trial-by-trial fluctuations in experimental data: More risks but hardly any benefit.</a></li>

<li>Sóskuthy, M. (2021). <a href="https://www.sciencedirect.com/science/article/pii/S009544702030108X">Evaluating generalised additive mixed modelling strategies for dynamic speech analysis</a></li>

<li>Winter, B., Wieling,</li>

<li>Wood, S. (2017). <a href="https://www.taylorfrancis.com/books/mono/10.1201/9781315370279/generalized-additive-models-simon-wood">Generalized Additive Mixed Models.</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Dale Barr</p>
<p class="date">Created: 2021-04-06 Tue 07:39</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
